OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0012) __sfr TRISB;

typedef struct
  {
  unsigned TRISB0               : 1;
  unsigned TRISB1               : 1;
  unsigned TRISB2               : 1;
  unsigned TRISB3               : 1;
  unsigned TRISB4               : 1;
  unsigned TRISB5               : 1;
  unsigned TRISB6               : 1;
  unsigned TRISB7               : 1;
  } __TRISBbits_t;

extern __at(0x0012) volatile __TRISBbits_t TRISBbits;

#define _TRISB0                 0x01
#define _TRISB1                 0x02
#define _TRISB2                 0x04
#define _TRISB3                 0x08
#define _TRISB4                 0x10
#define _TRISB5                 0x20
#define _TRISB6                 0x40
#define _TRISB7                 0x80

//==============================================================================


//==============================================================================
//        TRISC Bits

extern __at(0x0013) __sfr TRISC;

typedef struct
  {
  unsigned TRISC0               : 1;
  unsigned TRISC1               : 1;
  unsigned TRISC2               : 1;
  unsigned TRISC3               : 1;
  unsigned TRISC4               : 1;
  unsigned TRISC5               : 1;
  unsigned TRISC6               : 1;
  unsigned TRISC7               : 1;
  } __TRISCbits_t;

extern __at(0x0013) volatile __TRISCbits_t TRISCbits;

#define _TRISC0                 0x01
#define _TRISC1                 0x02
#define _TRISC2                 0x04
#define _TRISC3                 0x08
#define _TRISC4                 0x10
#define _TRISC5                 0x20
#define _TRISC6                 0x40
#define _TRISC7                 0x80

//==============================================================================


//==============================================================================
//        LATA Bits

extern __at(0x0016) __sfr LATA;

typedef struct
  {
  unsigned LATA0                : 1;
  unsigned LATA1                : 1;
  unsigned LATA2                : 1;
  unsigned LATA3                : 1;
  unsigned LATA4                : 1;
  unsigned LATA5                : 1;
  unsigned LATA6                : 1;
  unsigned LATA7                : 1;
  } __LATAbits_t;

extern __at(0x0016) volatile __LATAbits_t LATAbits;

#define _LATA0                  0x01
#define _LATA1                  0x02
#define _LATA2                  0x04
#define _LATA3                  0x08
#define _LATA4                  0x10
#define _LATA5                  0x20
#define _LATA6                  0x40
#define _LATA7                  0x80

//==============================================================================


//==============================================================================
//        LATB Bits

extern __at(0x0017) __sfr LATB;

typedef struct
  {
  unsigned LATB0                : 1;
  unsigned LATB1                : 1;
  unsigned LATB2                : 1;
  unsigned LATB3                : 1;
  unsigned LATB4                : 1;
  unsigned LATB5                : 1;
  unsigned LATB6                : 1;
  unsigned LATB7                : 1;
  } __LATBbits_t;

extern __at(0x0017) volatile __LATBbits_t LATBbits;

#define _LATB0                  0x01
#define _LATB1                  0x02
#define _LATB2                  0x04
#define _LATB3                  0x08
#define _LATB4                  0x10
#define _LATB5                  0x20
#define _LATB6                  0x40
#define _LATB7                  0x80

//==============================================================================


//==============================================================================
//        LATC Bits

extern __at(0x0018) __sfr LATC;

typedef struct
  {
  unsigned LATC0                : 1;
  unsigned LATC1                : 1;
  unsigned LATC2                : 1;
  unsigned LATC3                : 1;
  unsigned LATC4                : 1;
  unsigned LATC5                : 1;
  unsigned LATC6                : 1;
  unsigned LATC7                : 1;
  } __LATCbits_t;

extern __at(0x0018) volatile __LATCbits_t LATCbits;

#define _LATC0                  0x01
#define _LATC1                  0x02
#define _LATC2                  0x04
#define _LATC3                  0x08
#define _LATC4                  0x10
#define _LATC5                  0x20
#define _LATC6                  0x40
#define _LATC7                  0x80

//==============================================================================


//==============================================================================
//        TMR0 Bits

extern __at(0x001C) __sfr TMR0;

typedef struct
  {
  unsigned TMR0L0               : 1;
  unsigned TMR0L1               : 1;
  unsigned TMR0L2               : 1;
  unsigned TMR0L3               : 1;
  unsigned TMR0L4               : 1;
  unsigned TMR0L5               : 1;
  unsigned TMR0L6               : 1;
  unsigned TMR0L7               : 1;
  } __TMR0bits_t;

extern __at(0x001C) volatile __TMR0bits_t TMR0bits;

#define _TMR0L0                 0x01
#define _TMR0L1                 0x02
#define _TMR0L2                 0x04
#define _TMR0L3                 0x08
#define _TMR0L4                 0x10
#define _TMR0L5                 0x20
#define _TMR0L6                 0x40
#define _TMR0L7                 0x80

//==============================================================================


//==============================================================================
//        TMR0L Bits

extern __at(0x001C) __sfr TMR0L;

typedef struct
  {
  unsigned TMR0L0               : 1;
  unsigned TMR0L1               : 1;
  unsigned TMR0L2               : 1;
  unsigned TMR0L3               : 1;
  unsigned TMR0L4               : 1;
  unsigned TMR0L5               : 1;
  unsigned TMR0L6               : 1;
  unsigned TMR0L7               : 1;
  } __TMR0Lbits_t;

extern __at(0x001C) volatile __TMR0Lbits_t TMR0Lbits;

#define _TMR0L_TMR0L0           0x01
#define _TMR0L_TMR0L1           0x02
#define _TMR0L_TMR0L2           0x04
#define _TMR0L_TMR0L3           0x08
#define _TMR0L_TMR0L4           0x10
#define _TMR0L_TMR0L5           0x20
#define _TMR0L_TMR0L6           0x40
#define _TMR0L_TMR0L7           0x80

//==============================================================================


//==============================================================================
//        PR0 Bits

extern __at(0x001D) __sfr PR0;

typedef union
  {
  struct
    {
    unsigned TMR0H0             : 1;
    unsigned TMR0H1             : 1;
    unsigned TMR0H2             : 1;
    unsigned TMR0H3             : 1;
    unsigned TMR0H4             : 1;
    unsigned TMR0H5             : 1;
    unsigned TMR0H6             : 1;
    unsigned TMR0H7             : 1;
    };

  struct
    {
    unsigned T0PR0              : 1;
    unsigned T0PR1              : 1;
    unsigned T0PR2              : 1;
    unsigned T0PR3              : 1;
    unsigned T0PR4              : 1;
    unsigned T0PR5              : 1;
    unsigned T0PR6              : 1;
    unsigned T0PR7              : 1;
    };
  } __PR0bits_t;

extern __at(0x001D) volatile __PR0bits_t PR0bits;

#define _TMR0H0                 0x01
#define _T0PR0                  0x01
#define _TMR0H1                 0x02
#define _T0PR1                  0x02
#define _TMR0H2                 0x04
#define _T0PR2                  0x04
#define _TMR0H3                 0x08
#define _T0PR3                  0x08
#define _TMR0H4                 0x10
#define _T0PR4                  0x10
#define _TMR0H5                 0x20
#define _T0PR5                  0x20
#define _TMR0H6                 0x40
#define _T0PR6                  0x40
#define _TMR0H7                 0x80
#define _T0PR7                  0x80

//==============================================================================


//==============================================================================
//        TMR0H Bits

