OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0113) __sfr ADSTPTH;

typedef struct
  {
  unsigned ADSTPT8              : 1;
  unsigned ADSTPT9              : 1;
  unsigned ADSTPT10             : 1;
  unsigned ADSTPT11             : 1;
  unsigned ADSTPT12             : 1;
  unsigned ADSTPT13             : 1;
  unsigned ADSTPT14             : 1;
  unsigned ADSTPT15             : 1;
  } __ADSTPTHbits_t;

extern __at(0x0113) volatile __ADSTPTHbits_t ADSTPTHbits;

#define _ADSTPT8                0x01
#define _ADSTPT9                0x02
#define _ADSTPT10               0x04
#define _ADSTPT11               0x08
#define _ADSTPT12               0x10
#define _ADSTPT13               0x20
#define _ADSTPT14               0x40
#define _ADSTPT15               0x80

//==============================================================================

extern __at(0x0114) __sfr ADFLTR;

//==============================================================================
//        ADFLTRL Bits

extern __at(0x0114) __sfr ADFLTRL;

typedef struct
  {
  unsigned ADFLTR0              : 1;
  unsigned ADFLTR1              : 1;
  unsigned ADFLTR2              : 1;
  unsigned ADFLTR3              : 1;
  unsigned ADFLTR4              : 1;
  unsigned ADFLTR5              : 1;
  unsigned ADFLTR6              : 1;
  unsigned ADFLTR7              : 1;
  } __ADFLTRLbits_t;

extern __at(0x0114) volatile __ADFLTRLbits_t ADFLTRLbits;

#define _ADFLTR0                0x01
#define _ADFLTR1                0x02
#define _ADFLTR2                0x04
#define _ADFLTR3                0x08
#define _ADFLTR4                0x10
#define _ADFLTR5                0x20
#define _ADFLTR6                0x40
#define _ADFLTR7                0x80

//==============================================================================


//==============================================================================
//        ADFLTRH Bits

extern __at(0x0115) __sfr ADFLTRH;

typedef struct
  {
  unsigned ADFLTR8              : 1;
  unsigned ADFLTR9              : 1;
  unsigned ADFLTR10             : 1;
  unsigned ADFLTR11             : 1;
  unsigned ADFLTR12             : 1;
  unsigned ADFLTR13             : 1;
  unsigned ADFLTR14             : 1;
  unsigned ADFLTR15             : 1;
  } __ADFLTRHbits_t;

extern __at(0x0115) volatile __ADFLTRHbits_t ADFLTRHbits;

#define _ADFLTR8                0x01
#define _ADFLTR9                0x02
#define _ADFLTR10               0x04
#define _ADFLTR11               0x08
#define _ADFLTR12               0x10
#define _ADFLTR13               0x20
#define _ADFLTR14               0x40
#define _ADFLTR15               0x80

//==============================================================================

extern __at(0x0116) __sfr ADERR;

//==============================================================================
//        ADERRL Bits

extern __at(0x0116) __sfr ADERRL;

typedef struct
  {
  unsigned ADERR0               : 1;
  unsigned ADERR1               : 1;
  unsigned ADERR2               : 1;
  unsigned ADERR3               : 1;
  unsigned ADERR4               : 1;
  unsigned ADERR5               : 1;
  unsigned ADERR6               : 1;
  unsigned ADERR7               : 1;
  } __ADERRLbits_t;

extern __at(0x0116) volatile __ADERRLbits_t ADERRLbits;

#define _ADERR0                 0x01
#define _ADERR1                 0x02
#define _ADERR2                 0x04
#define _ADERR3                 0x08
#define _ADERR4                 0x10
#define _ADERR5                 0x20
#define _ADERR6                 0x40
#define _ADERR7                 0x80

//==============================================================================


//==============================================================================
//        ADERRH Bits

extern __at(0x0117) __sfr ADERRH;

typedef struct
  {
  unsigned ADERR8               : 1;
  unsigned ADERR9               : 1;
  unsigned ADERR10              : 1;
  unsigned ADERR11              : 1;
  unsigned ADERR12              : 1;
  unsigned ADERR13              : 1;
  unsigned ADERR14              : 1;
  unsigned ADERR15              : 1;
  } __ADERRHbits_t;

extern __at(0x0117) volatile __ADERRHbits_t ADERRHbits;

#define _ADERR8                 0x01
#define _ADERR9                 0x02
#define _ADERR10                0x04
#define _ADERR11                0x08
#define _ADERR12                0x10
#define _ADERR13                0x20
#define _ADERR14                0x40
#define _ADERR15                0x80

//==============================================================================

extern __at(0x0119) __sfr RC1REG;
extern __at(0x0119) __sfr RCREG;
extern __at(0x0119) __sfr RCREG1;
extern __at(0x011A) __sfr TX1REG;
extern __at(0x011A) __sfr TXREG;
extern __at(0x011A) __sfr TXREG1;
extern __at(0x011B) __sfr SP1BRG;
extern __at(0x011B) __sfr SP1BRGL;
extern __at(0x011B) __sfr SPBRG;
extern __at(0x011B) __sfr SPBRG1;
extern __at(0x011B) __sfr SPBRGL;
extern __at(0x011C) __sfr SP1BRGH;
extern __at(0x011C) __sfr SPBRGH;
extern __at(0x011C) __sfr SPBRGH1;

//==============================================================================
//        RC1STA Bits

extern __at(0x011D) __sfr RC1STA;

typedef struct
  {
  unsigned RX9D                 : 1;
  unsigned OERR                 : 1;
  unsigned FERR                 : 1;
  unsigned ADDEN                : 1;
  unsigned CREN                 : 1;
  unsigned SREN                 : 1;
  unsigned RX9                  : 1;
  unsigned SPEN                 : 1;
  } __RC1STAbits_t;

extern __at(0x011D) volatile __RC1STAbits_t RC1STAbits;

#define _RX9D                   0x01
#define _OERR                   0x02
#define _FERR                   0x04
#define _ADDEN                  0x08
#define _CREN                   0x10
#define _SREN                   0x20
#define _RX9                    0x40
#define _SPEN                   0x80

//==============================================================================


//==============================================================================
//        RCSTA Bits

extern __at(0x011D) __sfr RCSTA;

typedef struct
  {
  unsigned RX9D                 : 1;
  unsigned OERR                 : 1;
  unsigned FERR                 : 1;
  unsigned ADDEN                : 1;
  unsigned CREN                 : 1;
  unsigned SREN                 : 1;
  unsigned RX9                  : 1;
  unsigned SPEN                 : 1;
  } __RCSTAbits_t;

extern __at(0x011D) volatile __RCSTAbits_t RCSTAbits;

#define _RCSTA_RX9D             0x01
#define _RCSTA_OERR             0x02
#define _RCSTA_FERR             0x04
#define _RCSTA_ADDEN            0x08
#define _RCSTA_CREN             0x10
#define _RCSTA_SREN             0x20
#define _RCSTA_RX9              0x40
#define _RCSTA_SPEN             0x80

//==============================================================================


//==============================================================================
//        RCSTA1 Bits

extern __at(0x011D) __sfr RCSTA1;

typedef struct
  {
  unsigned RX9D                 : 1;
  unsigned OERR                 : 1;
  unsigned FERR                 : 1;
  unsigned ADDEN                : 1;
  unsigned CREN                 : 1;
  unsigned SREN                 : 1;
  unsigned RX9                  : 1;
  unsigned SPEN                 : 1;
  } __RCSTA1bits_t;

extern __at(0x011D) volatile __RCSTA1bits_t RCSTA1bits;

#define _RCSTA1_RX9D            0x01
#define _RCSTA1_OERR            0x02
#define _RCSTA1_FERR            0x04
#define _RCSTA1_ADDEN           0x08
#define _RCSTA1_CREN            0x10
#define _RCSTA1_SREN            0x20
#define _RCSTA1_RX9             0x40
#define _RCSTA1_SPEN            0x80

//==============================================================================


//==============================================================================
//        TX1STA Bits

extern __at(0x011E) __sfr TX1STA;

typedef struct
  {
  unsigned TX9D                 : 1;
  unsigned TRMT                 : 1;
  unsigned BRGH                 : 1;
  unsigned SENDB                : 1;
  unsigned SYNC                 : 1;
  unsigned TXEN                 : 1;
  unsigned TX9                  : 1;
  unsigned CSRC                 : 1;
  } __TX1STAbits_t;

extern __at(0x011E) volatile __TX1STAbits_t TX1STAbits;

#define _TX1STA_TX9D            0x01
#define _TX1STA_TRMT            0x02
#define _TX1STA_BRGH            0x04
#define _TX1STA_SENDB           0x08
#define _TX1STA_SYNC            0x10
#define _TX1STA_TXEN            0x20
#define _TX1STA_TX9             0x40
#define _TX1STA_CSRC            0x80

//==============================================================================


//==============================================================================
//        TXSTA Bits

extern __at(0x011E) __sfr TXSTA;

typedef struct
  {
  unsigned TX9D                 : 1;
  unsigned TRMT                 : 1;
  unsigned BRGH                 : 1;
  unsigned SENDB                : 1;
  unsigned SYNC                 : 1;
  unsigned TXEN                 : 1;
  unsigned TX9                  : 1;
  unsigned CSRC                 : 1;
  } __TXSTAbits_t;

