OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0510) __sfr SMT2CPRH;

typedef union
  {
  struct
    {
    unsigned CPR8               : 1;
    unsigned CPR9               : 1;
    unsigned CPR10              : 1;
    unsigned CPR11              : 1;
    unsigned CPR12              : 1;
    unsigned CPR13              : 1;
    unsigned CPR14              : 1;
    unsigned CPR15              : 1;
    };

  struct
    {
    unsigned SMT2CPR8           : 1;
    unsigned SMT2CPR9           : 1;
    unsigned SMT2CPR10          : 1;
    unsigned SMT2CPR11          : 1;
    unsigned SMT2CPR12          : 1;
    unsigned SMT2CPR13          : 1;
    unsigned SMT2CPR14          : 1;
    unsigned SMT2CPR15          : 1;
    };
  } __SMT2CPRHbits_t;

extern __at(0x0510) volatile __SMT2CPRHbits_t SMT2CPRHbits;

#define _SMT2CPRH_CPR8          0x01
#define _SMT2CPRH_SMT2CPR8      0x01
#define _SMT2CPRH_CPR9          0x02
#define _SMT2CPRH_SMT2CPR9      0x02
#define _SMT2CPRH_CPR10         0x04
#define _SMT2CPRH_SMT2CPR10     0x04
#define _SMT2CPRH_CPR11         0x08
#define _SMT2CPRH_SMT2CPR11     0x08
#define _SMT2CPRH_CPR12         0x10
#define _SMT2CPRH_SMT2CPR12     0x10
#define _SMT2CPRH_CPR13         0x20
#define _SMT2CPRH_SMT2CPR13     0x20
#define _SMT2CPRH_CPR14         0x40
#define _SMT2CPRH_SMT2CPR14     0x40
#define _SMT2CPRH_CPR15         0x80
#define _SMT2CPRH_SMT2CPR15     0x80

//==============================================================================


//==============================================================================
//        SMT2CPRU Bits

extern __at(0x0511) __sfr SMT2CPRU;

typedef union
  {
  struct
    {
    unsigned CPR16              : 1;
    unsigned CPR17              : 1;
    unsigned CPR18              : 1;
    unsigned CPR19              : 1;
    unsigned CPR20              : 1;
    unsigned CPR21              : 1;
    unsigned CPR22              : 1;
    unsigned CPR23              : 1;
    };

  struct
    {
    unsigned SMT2CPR16          : 1;
    unsigned SMT2CPR17          : 1;
    unsigned SMT2CPR18          : 1;
    unsigned SMT2CPR19          : 1;
    unsigned SMT2CPR20          : 1;
    unsigned SMT2CPR21          : 1;
    unsigned SMT2CPR22          : 1;
    unsigned SMT2CPR23          : 1;
    };
  } __SMT2CPRUbits_t;

extern __at(0x0511) volatile __SMT2CPRUbits_t SMT2CPRUbits;

#define _SMT2CPRU_CPR16         0x01
#define _SMT2CPRU_SMT2CPR16     0x01
#define _SMT2CPRU_CPR17         0x02
#define _SMT2CPRU_SMT2CPR17     0x02
#define _SMT2CPRU_CPR18         0x04
#define _SMT2CPRU_SMT2CPR18     0x04
#define _SMT2CPRU_CPR19         0x08
#define _SMT2CPRU_SMT2CPR19     0x08
#define _SMT2CPRU_CPR20         0x10
#define _SMT2CPRU_SMT2CPR20     0x10
#define _SMT2CPRU_CPR21         0x20
#define _SMT2CPRU_SMT2CPR21     0x20
#define _SMT2CPRU_CPR22         0x40
#define _SMT2CPRU_SMT2CPR22     0x40
#define _SMT2CPRU_CPR23         0x80
#define _SMT2CPRU_SMT2CPR23     0x80

//==============================================================================

extern __at(0x0512) __sfr SMT2CPW;

//==============================================================================
//        SMT2CPWL Bits

extern __at(0x0512) __sfr SMT2CPWL;

typedef union
  {
  struct
    {
    unsigned CPW0               : 1;
    unsigned CPW1               : 1;
    unsigned CPW2               : 1;
    unsigned CPW3               : 1;
    unsigned CPW4               : 1;
    unsigned CPW5               : 1;
    unsigned CPW6               : 1;
    unsigned CPW7               : 1;
    };

  struct
    {
    unsigned SMT2CPW0           : 1;
    unsigned SMT2CPW1           : 1;
    unsigned SMT2CPW2           : 1;
    unsigned SMT2CPW3           : 1;
    unsigned SMT2CPW4           : 1;
    unsigned SMT2CPW5           : 1;
    unsigned SMT2CPW6           : 1;
    unsigned SMT2CPW7           : 1;
    };
  } __SMT2CPWLbits_t;

extern __at(0x0512) volatile __SMT2CPWLbits_t SMT2CPWLbits;

#define _SMT2CPWL_CPW0          0x01
#define _SMT2CPWL_SMT2CPW0      0x01
#define _SMT2CPWL_CPW1          0x02
#define _SMT2CPWL_SMT2CPW1      0x02
#define _SMT2CPWL_CPW2          0x04
#define _SMT2CPWL_SMT2CPW2      0x04
#define _SMT2CPWL_CPW3          0x08
#define _SMT2CPWL_SMT2CPW3      0x08
#define _SMT2CPWL_CPW4          0x10
#define _SMT2CPWL_SMT2CPW4      0x10
#define _SMT2CPWL_CPW5          0x20
#define _SMT2CPWL_SMT2CPW5      0x20
#define _SMT2CPWL_CPW6          0x40
#define _SMT2CPWL_SMT2CPW6      0x40
#define _SMT2CPWL_CPW7          0x80
#define _SMT2CPWL_SMT2CPW7      0x80

//==============================================================================


//==============================================================================
//        SMT2CPWH Bits

extern __at(0x0513) __sfr SMT2CPWH;

typedef union
  {
  struct
    {
    unsigned CPW8               : 1;
    unsigned CPW9               : 1;
    unsigned CPW10              : 1;
    unsigned CPW11              : 1;
    unsigned CPW12              : 1;
    unsigned CPW13              : 1;
    unsigned CPW14              : 1;
    unsigned CPW15              : 1;
    };

  struct
    {
    unsigned SMT2CPW8           : 1;
    unsigned SMT2CPW9           : 1;
    unsigned SMT2CPW10          : 1;
    unsigned SMT2CPW11          : 1;
    unsigned SMT2CPW12          : 1;
    unsigned SMT2CPW13          : 1;
    unsigned SMT2CPW14          : 1;
    unsigned SMT2CPW15          : 1;
    };
  } __SMT2CPWHbits_t;

extern __at(0x0513) volatile __SMT2CPWHbits_t SMT2CPWHbits;

#define _SMT2CPWH_CPW8          0x01
#define _SMT2CPWH_SMT2CPW8      0x01
#define _SMT2CPWH_CPW9          0x02
#define _SMT2CPWH_SMT2CPW9      0x02
#define _SMT2CPWH_CPW10         0x04
#define _SMT2CPWH_SMT2CPW10     0x04
#define _SMT2CPWH_CPW11         0x08
#define _SMT2CPWH_SMT2CPW11     0x08
#define _SMT2CPWH_CPW12         0x10
#define _SMT2CPWH_SMT2CPW12     0x10
#define _SMT2CPWH_CPW13         0x20
#define _SMT2CPWH_SMT2CPW13     0x20
#define _SMT2CPWH_CPW14         0x40
#define _SMT2CPWH_SMT2CPW14     0x40
#define _SMT2CPWH_CPW15         0x80
#define _SMT2CPWH_SMT2CPW15     0x80

//==============================================================================


//==============================================================================
//        SMT2CPWU Bits

extern __at(0x0514) __sfr SMT2CPWU;

typedef union
  {
  struct
    {
    unsigned CPW16              : 1;
    unsigned CPW17              : 1;
    unsigned CPW18              : 1;
    unsigned CPW19              : 1;
    unsigned CPW20              : 1;
    unsigned CPW21              : 1;
    unsigned CPW22              : 1;
    unsigned CPW23              : 1;
    };

  struct
    {
    unsigned SMT2CPW16          : 1;
    unsigned SMT2CPW17          : 1;
    unsigned SMT2CPW18          : 1;
    unsigned SMT2CPW19          : 1;
    unsigned SMT2CPW20          : 1;
    unsigned SMT2CPW21          : 1;
    unsigned SMT2CPW22          : 1;
    unsigned SMT2CPW23          : 1;
    };
  } __SMT2CPWUbits_t;

extern __at(0x0514) volatile __SMT2CPWUbits_t SMT2CPWUbits;

#define _SMT2CPWU_CPW16         0x01
#define _SMT2CPWU_SMT2CPW16     0x01
#define _SMT2CPWU_CPW17         0x02
#define _SMT2CPWU_SMT2CPW17     0x02
#define _SMT2CPWU_CPW18         0x04
#define _SMT2CPWU_SMT2CPW18     0x04
#define _SMT2CPWU_CPW19         0x08
#define _SMT2CPWU_SMT2CPW19     0x08
#define _SMT2CPWU_CPW20         0x10
#define _SMT2CPWU_SMT2CPW20     0x10
#define _SMT2CPWU_CPW21         0x20
#define _SMT2CPWU_SMT2CPW21     0x20
#define _SMT2CPWU_CPW22         0x40
#define _SMT2CPWU_SMT2CPW22     0x40
#define _SMT2CPWU_CPW23         0x80
#define _SMT2CPWU_SMT2CPW23     0x80

//==============================================================================

extern __at(0x0515) __sfr SMT2PR;

//==============================================================================
//        SMT2PRL Bits

