OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x068F) volatile __CWG3DBFbits_t CWG3DBFbits;

#define _CWG3DBF_DBF0           0x01
#define _CWG3DBF_CWG3DBF0       0x01
#define _CWG3DBF_DBF1           0x02
#define _CWG3DBF_CWG3DBF1       0x02
#define _CWG3DBF_DBF2           0x04
#define _CWG3DBF_CWG3DBF2       0x04
#define _CWG3DBF_DBF3           0x08
#define _CWG3DBF_CWG3DBF3       0x08
#define _CWG3DBF_DBF4           0x10
#define _CWG3DBF_CWG3DBF4       0x10
#define _CWG3DBF_DBF5           0x20
#define _CWG3DBF_CWG3DBF5       0x20

//==============================================================================


//==============================================================================
//        CWG3CON0 Bits

extern __at(0x0690) __sfr CWG3CON0;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LD                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned CWG3MODE0          : 1;
    unsigned CWG3MODE1          : 1;
    unsigned CWG3MODE2          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CWG3LD             : 1;
    unsigned G3EN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CWG3EN             : 1;
    };

  struct
    {
    unsigned CWG3MODE           : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned MODE               : 3;
    unsigned                    : 5;
    };
  } __CWG3CON0bits_t;

extern __at(0x0690) volatile __CWG3CON0bits_t CWG3CON0bits;

#define _CWG3CON0_MODE0         0x01
#define _CWG3CON0_CWG3MODE0     0x01
#define _CWG3CON0_MODE1         0x02
#define _CWG3CON0_CWG3MODE1     0x02
#define _CWG3CON0_MODE2         0x04
#define _CWG3CON0_CWG3MODE2     0x04
#define _CWG3CON0_LD            0x40
#define _CWG3CON0_CWG3LD        0x40
#define _CWG3CON0_EN            0x80
#define _CWG3CON0_G3EN          0x80
#define _CWG3CON0_CWG3EN        0x80

//==============================================================================


//==============================================================================
//        CWG3CON1 Bits

extern __at(0x0691) __sfr CWG3CON1;

typedef union
  {
  struct
    {
    unsigned POLA               : 1;
    unsigned POLB               : 1;
    unsigned POLC               : 1;
    unsigned POLD               : 1;
    unsigned                    : 1;
    unsigned IN                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG3POLA           : 1;
    unsigned CWG3POLB           : 1;
    unsigned CWG3POLC           : 1;
    unsigned CWG3POLD           : 1;
    unsigned                    : 1;
    unsigned CWG3IN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CWG3CON1bits_t;

extern __at(0x0691) volatile __CWG3CON1bits_t CWG3CON1bits;

#define _CWG3CON1_POLA          0x01
#define _CWG3CON1_CWG3POLA      0x01
#define _CWG3CON1_POLB          0x02
#define _CWG3CON1_CWG3POLB      0x02
#define _CWG3CON1_POLC          0x04
#define _CWG3CON1_CWG3POLC      0x04
#define _CWG3CON1_POLD          0x08
#define _CWG3CON1_CWG3POLD      0x08
#define _CWG3CON1_IN            0x20
#define _CWG3CON1_CWG3IN        0x20

//==============================================================================


//==============================================================================
//        CWG3AS0 Bits

extern __at(0x0692) __sfr CWG3AS0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LSAC0              : 1;
    unsigned LSAC1              : 1;
    unsigned LSBD0              : 1;
    unsigned LSBD1              : 1;
    unsigned REN                : 1;
    unsigned SHUTDOWN           : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CWG3LSAC0          : 1;
    unsigned CWG3LSAC1          : 1;
    unsigned CWG3LSBD0          : 1;
    unsigned CWG3LSBD1          : 1;
    unsigned CWG3REN            : 1;
    unsigned CWG3SHUTDOWN       : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned LSAC               : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CWG3LSAC           : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CWG3LSBD           : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned LSBD               : 2;
    unsigned                    : 2;
    };
  } __CWG3AS0bits_t;

extern __at(0x0692) volatile __CWG3AS0bits_t CWG3AS0bits;

#define _CWG3AS0_LSAC0          0x04
#define _CWG3AS0_CWG3LSAC0      0x04
#define _CWG3AS0_LSAC1          0x08
#define _CWG3AS0_CWG3LSAC1      0x08
#define _CWG3AS0_LSBD0          0x10
#define _CWG3AS0_CWG3LSBD0      0x10
#define _CWG3AS0_LSBD1          0x20
#define _CWG3AS0_CWG3LSBD1      0x20
#define _CWG3AS0_REN            0x40
#define _CWG3AS0_CWG3REN        0x40
#define _CWG3AS0_SHUTDOWN       0x80
#define _CWG3AS0_CWG3SHUTDOWN   0x80

//==============================================================================


//==============================================================================
//        CWG3AS1 Bits

extern __at(0x0693) __sfr CWG3AS1;

typedef struct
  {
  unsigned AS0E                 : 1;
  unsigned AS1E                 : 1;
  unsigned AS2E                 : 1;
  unsigned AS3E                 : 1;
  unsigned AS4E                 : 1;
  unsigned AS5E                 : 1;
  unsigned AS6E                 : 1;
  unsigned                      : 1;
  } __CWG3AS1bits_t;

extern __at(0x0693) volatile __CWG3AS1bits_t CWG3AS1bits;

#define _CWG3AS1_AS0E           0x01
#define _CWG3AS1_AS1E           0x02
#define _CWG3AS1_AS2E           0x04
#define _CWG3AS1_AS3E           0x08
#define _CWG3AS1_AS4E           0x10
#define _CWG3AS1_AS5E           0x20
#define _CWG3AS1_AS6E           0x40

//==============================================================================


//==============================================================================
//        CWG3STR Bits

extern __at(0x0694) __sfr CWG3STR;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned OVRA               : 1;
    unsigned OVRB               : 1;
    unsigned OVRC               : 1;
    unsigned OVRD               : 1;
    };

  struct
    {
    unsigned CWG3STRA           : 1;
    unsigned CWG3STRB           : 1;
    unsigned CWG3STRC           : 1;
    unsigned CWG3STRD           : 1;
    unsigned CWG3OVRA           : 1;
    unsigned CWG3OVRB           : 1;
    unsigned CWG3OVRC           : 1;
    unsigned CWG3OVRD           : 1;
    };
  } __CWG3STRbits_t;

extern __at(0x0694) volatile __CWG3STRbits_t CWG3STRbits;

#define _CWG3STR_STRA           0x01
#define _CWG3STR_CWG3STRA       0x01
#define _CWG3STR_STRB           0x02
#define _CWG3STR_CWG3STRB       0x02
#define _CWG3STR_STRC           0x04
#define _CWG3STR_CWG3STRC       0x04
#define _CWG3STR_STRD           0x08
#define _CWG3STR_CWG3STRD       0x08
#define _CWG3STR_OVRA           0x10
#define _CWG3STR_CWG3OVRA       0x10
#define _CWG3STR_OVRB           0x20
#define _CWG3STR_CWG3OVRB       0x20
#define _CWG3STR_OVRC           0x40
#define _CWG3STR_CWG3OVRC       0x40
#define _CWG3STR_OVRD           0x80
#define _CWG3STR_CWG3OVRD       0x80

//==============================================================================


//==============================================================================
//        PIR0 Bits

extern __at(0x070C) __sfr PIR0;

typedef struct
  {
  unsigned INTF                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCIF                : 1;
  unsigned TMR0IF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIR0bits_t;

