OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0714) volatile __PIR8bits_t PIR8bits;

#define _SMT1IF                 0x01
#define _SMT1PRAIF              0x02
#define _SMT1PWAIF              0x04
#define _SMT2IF                 0x08
#define _SMT2PRAIF              0x10
#define _SMT2PWAIF              0x20

//==============================================================================


//==============================================================================
//        PIE0 Bits

extern __at(0x0716) __sfr PIE0;

typedef struct
  {
  unsigned INTE                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCIE                : 1;
  unsigned TMR0IE               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIE0bits_t;

extern __at(0x0716) volatile __PIE0bits_t PIE0bits;

#define _INTE                   0x01
#define _IOCIE                  0x10
#define _TMR0IE                 0x20

//==============================================================================


//==============================================================================
//        PIE1 Bits

extern __at(0x0717) __sfr PIE1;

typedef struct
  {
  unsigned ADIE                 : 1;
  unsigned ADTIE                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CSWIE                : 1;
  unsigned OSFIE                : 1;
  } __PIE1bits_t;

extern __at(0x0717) volatile __PIE1bits_t PIE1bits;

#define _ADIE                   0x01
#define _ADTIE                  0x02
#define _CSWIE                  0x40
#define _OSFIE                  0x80

//==============================================================================


//==============================================================================
//        PIE2 Bits

extern __at(0x0718) __sfr PIE2;

typedef struct
  {
  unsigned C1IE                 : 1;
  unsigned C2IE                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ZCDIE                : 1;
  unsigned                      : 1;
  } __PIE2bits_t;

extern __at(0x0718) volatile __PIE2bits_t PIE2bits;

#define _C1IE                   0x01
#define _C2IE                   0x02
#define _ZCDIE                  0x40

//==============================================================================


//==============================================================================
//        PIE3 Bits

extern __at(0x0719) __sfr PIE3;

typedef struct
  {
  unsigned SSP1IE               : 1;
  unsigned BCL1IE               : 1;
  unsigned SSP2IE               : 1;
  unsigned BCL2IE               : 1;
  unsigned TXIE                 : 1;
  unsigned RCIE                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIE3bits_t;

extern __at(0x0719) volatile __PIE3bits_t PIE3bits;

#define _SSP1IE                 0x01
#define _BCL1IE                 0x02
#define _SSP2IE                 0x04
#define _BCL2IE                 0x08
#define _TXIE                   0x10
#define _RCIE                   0x20

//==============================================================================


//==============================================================================
//        PIE4 Bits

extern __at(0x071A) __sfr PIE4;

typedef struct
  {
  unsigned TMR1IE               : 1;
  unsigned TMR2IE               : 1;
  unsigned TMR3IE               : 1;
  unsigned TMR4IE               : 1;
  unsigned TMR5IE               : 1;
  unsigned TMR6IE               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIE4bits_t;

extern __at(0x071A) volatile __PIE4bits_t PIE4bits;

#define _TMR1IE                 0x01
#define _TMR2IE                 0x02
#define _TMR3IE                 0x04
#define _TMR4IE                 0x08
#define _TMR5IE                 0x10
#define _TMR6IE                 0x20

//==============================================================================


//==============================================================================
//        PIE5 Bits

extern __at(0x071B) __sfr PIE5;

typedef struct
  {
  unsigned TMR1GIE              : 1;
  unsigned TMR3GIE              : 1;
  unsigned TMR5GIE              : 1;
  unsigned                      : 1;
  unsigned CLC1IE               : 1;
  unsigned CLC2IE               : 1;
  unsigned CLC3IE               : 1;
  unsigned CLC4IE               : 1;
  } __PIE5bits_t;

extern __at(0x071B) volatile __PIE5bits_t PIE5bits;

#define _TMR1GIE                0x01
#define _TMR3GIE                0x02
#define _TMR5GIE                0x04
#define _CLC1IE                 0x10
#define _CLC2IE                 0x20
#define _CLC3IE                 0x40
#define _CLC4IE                 0x80

//==============================================================================


//==============================================================================
//        PIE6 Bits

extern __at(0x071C) __sfr PIE6;

typedef struct
  {
  unsigned CCP1IE               : 1;
  unsigned CCP2IE               : 1;
  unsigned CCP3IE               : 1;
  unsigned CCP4IE               : 1;
  unsigned CCP5IE               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIE6bits_t;

extern __at(0x071C) volatile __PIE6bits_t PIE6bits;

#define _CCP1IE                 0x01
#define _CCP2IE                 0x02
#define _CCP3IE                 0x04
#define _CCP4IE                 0x08
#define _CCP5IE                 0x10

//==============================================================================


//==============================================================================
//        PIE7 Bits

extern __at(0x071D) __sfr PIE7;

typedef union
  {
  struct
    {
    unsigned CWG1IE             : 1;
    unsigned CWG2IE             : 1;
    unsigned CWG3IE             : 1;
    unsigned                    : 1;
    unsigned NCO1IE             : 1;
    unsigned NVMIE              : 1;
    unsigned CRCIE              : 1;
    unsigned SCANIE             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NCOIE              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PIE7bits_t;

extern __at(0x071D) volatile __PIE7bits_t PIE7bits;

#define _CWG1IE                 0x01
#define _CWG2IE                 0x02
#define _CWG3IE                 0x04
#define _NCO1IE                 0x10
#define _NCOIE                  0x10
#define _NVMIE                  0x20
#define _CRCIE                  0x40
#define _SCANIE                 0x80

//==============================================================================


//==============================================================================
//        PIE8 Bits

