OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0E97) volatile __T5GPPSbits_t T5GPPSbits;

#define _T5GPPS0                0x01
#define _T5GPPS1                0x02
#define _T5GPPS2                0x04
#define _T5GPPS3                0x08
#define _T5GPPS4                0x10

//==============================================================================


//==============================================================================
//        T2AINPPS Bits

extern __at(0x0E9C) __sfr T2AINPPS;

typedef union
  {
  struct
    {
    unsigned T2AINPPS0          : 1;
    unsigned T2AINPPS1          : 1;
    unsigned T2AINPPS2          : 1;
    unsigned T2AINPPS3          : 1;
    unsigned T2AINPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T2AINPPS           : 5;
    unsigned                    : 3;
    };
  } __T2AINPPSbits_t;

extern __at(0x0E9C) volatile __T2AINPPSbits_t T2AINPPSbits;

#define _T2AINPPS0              0x01
#define _T2AINPPS1              0x02
#define _T2AINPPS2              0x04
#define _T2AINPPS3              0x08
#define _T2AINPPS4              0x10

//==============================================================================


//==============================================================================
//        T4AINPPS Bits

extern __at(0x0E9D) __sfr T4AINPPS;

typedef union
  {
  struct
    {
    unsigned T4AINPPS0          : 1;
    unsigned T4AINPPS1          : 1;
    unsigned T4AINPPS2          : 1;
    unsigned T4AINPPS3          : 1;
    unsigned T4AINPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T4AINPPS           : 5;
    unsigned                    : 3;
    };
  } __T4AINPPSbits_t;

extern __at(0x0E9D) volatile __T4AINPPSbits_t T4AINPPSbits;

#define _T4AINPPS0              0x01
#define _T4AINPPS1              0x02
#define _T4AINPPS2              0x04
#define _T4AINPPS3              0x08
#define _T4AINPPS4              0x10

//==============================================================================


//==============================================================================
//        T6AINPPS Bits

extern __at(0x0E9E) __sfr T6AINPPS;

typedef union
  {
  struct
    {
    unsigned T6AINPPS0          : 1;
    unsigned T6AINPPS1          : 1;
    unsigned T6AINPPS2          : 1;
    unsigned T6AINPPS3          : 1;
    unsigned T6AINPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T6AINPPS           : 5;
    unsigned                    : 3;
    };
  } __T6AINPPSbits_t;

extern __at(0x0E9E) volatile __T6AINPPSbits_t T6AINPPSbits;

#define _T6AINPPS0              0x01
#define _T6AINPPS1              0x02
#define _T6AINPPS2              0x04
#define _T6AINPPS3              0x08
#define _T6AINPPS4              0x10

//==============================================================================


//==============================================================================
//        CCP1PPS Bits

extern __at(0x0EA1) __sfr CCP1PPS;

typedef union
  {
  struct
    {
    unsigned CCP1PPS0           : 1;
    unsigned CCP1PPS1           : 1;
    unsigned CCP1PPS2           : 1;
    unsigned CCP1PPS3           : 1;
    unsigned CCP1PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1PPS            : 5;
    unsigned                    : 3;
    };
  } __CCP1PPSbits_t;

extern __at(0x0EA1) volatile __CCP1PPSbits_t CCP1PPSbits;

#define _CCP1PPS0               0x01
#define _CCP1PPS1               0x02
#define _CCP1PPS2               0x04
#define _CCP1PPS3               0x08
#define _CCP1PPS4               0x10

//==============================================================================


//==============================================================================
//        CCP2PPS Bits

extern __at(0x0EA2) __sfr CCP2PPS;

typedef union
  {
  struct
    {
    unsigned CCP2PPS0           : 1;
    unsigned CCP2PPS1           : 1;
    unsigned CCP2PPS2           : 1;
    unsigned CCP2PPS3           : 1;
    unsigned CCP2PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP2PPS            : 5;
    unsigned                    : 3;
    };
  } __CCP2PPSbits_t;

extern __at(0x0EA2) volatile __CCP2PPSbits_t CCP2PPSbits;

#define _CCP2PPS0               0x01
#define _CCP2PPS1               0x02
#define _CCP2PPS2               0x04
#define _CCP2PPS3               0x08
#define _CCP2PPS4               0x10

//==============================================================================


//==============================================================================
//        CCP3PPS Bits

extern __at(0x0EA3) __sfr CCP3PPS;

typedef union
  {
  struct
    {
    unsigned CCP3PPS0           : 1;
    unsigned CCP3PPS1           : 1;
    unsigned CCP3PPS2           : 1;
    unsigned CCP3PPS3           : 1;
    unsigned CCP3PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP3PPS            : 5;
    unsigned                    : 3;
    };
  } __CCP3PPSbits_t;

extern __at(0x0EA3) volatile __CCP3PPSbits_t CCP3PPSbits;

#define _CCP3PPS0               0x01
#define _CCP3PPS1               0x02
#define _CCP3PPS2               0x04
#define _CCP3PPS3               0x08
#define _CCP3PPS4               0x10

//==============================================================================


//==============================================================================
//        CCP4PPS Bits

extern __at(0x0EA4) __sfr CCP4PPS;

typedef union
  {
  struct
    {
    unsigned CCP4PPS0           : 1;
    unsigned CCP4PPS1           : 1;
    unsigned CCP4PPS2           : 1;
    unsigned CCP4PPS3           : 1;
    unsigned CCP4PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP4PPS            : 5;
    unsigned                    : 3;
    };
  } __CCP4PPSbits_t;

extern __at(0x0EA4) volatile __CCP4PPSbits_t CCP4PPSbits;

#define _CCP4PPS0               0x01
#define _CCP4PPS1               0x02
#define _CCP4PPS2               0x04
#define _CCP4PPS3               0x08
#define _CCP4PPS4               0x10

//==============================================================================


//==============================================================================
//        CCP5PPS Bits

extern __at(0x0EA5) __sfr CCP5PPS;

typedef union
  {
  struct
    {
    unsigned CCP5PPS0           : 1;
    unsigned CCP5PPS1           : 1;
    unsigned CCP5PPS2           : 1;
    unsigned CCP5PPS3           : 1;
    unsigned CCP5PPS4           : 1;
    unsigned CCP6PPS            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP5PPS            : 5;
    unsigned                    : 3;
    };
  } __CCP5PPSbits_t;

extern __at(0x0EA5) volatile __CCP5PPSbits_t CCP5PPSbits;

#define _CCP5PPS0               0x01
#define _CCP5PPS1               0x02
#define _CCP5PPS2               0x04
#define _CCP5PPS3               0x08
#define _CCP5PPS4               0x10
#define _CCP6PPS                0x20

//==============================================================================


//==============================================================================
//        SMT1WINPPS Bits

extern __at(0x0EA9) __sfr SMT1WINPPS;

typedef union
  {
  struct
    {
    unsigned SMU1WINPPS0        : 1;
    unsigned SMU1WINPPS1        : 1;
    unsigned SMU1WINPPS2        : 1;
    unsigned SMU1WINPPS3        : 1;
    unsigned SMU1WINPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMU1WINPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT1WINPPSbits_t;

extern __at(0x0EA9) volatile __SMT1WINPPSbits_t SMT1WINPPSbits;

#define _SMU1WINPPS0            0x01
#define _SMU1WINPPS1            0x02
#define _SMU1WINPPS2            0x04
#define _SMU1WINPPS3            0x08
#define _SMU1WINPPS4            0x10

//==============================================================================


//==============================================================================
//        SMT1SIGPPS Bits

extern __at(0x0EAA) __sfr SMT1SIGPPS;

typedef union
  {
  struct
    {
    unsigned SMU1SIGPPS0        : 1;
    unsigned SMU1SIGPPS1        : 1;
    unsigned SMU1SIGPPS2        : 1;
    unsigned SMU1SIGPPS3        : 1;
    unsigned SMU1SIGPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMU1SIGPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT1SIGPPSbits_t;

extern __at(0x0EAA) volatile __SMT1SIGPPSbits_t SMT1SIGPPSbits;

