OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
#define _SMU1SIGPPS0            0x01
#define _SMU1SIGPPS1            0x02
#define _SMU1SIGPPS2            0x04
#define _SMU1SIGPPS3            0x08
#define _SMU1SIGPPS4            0x10

//==============================================================================


//==============================================================================
//        SMT2WINPPS Bits

extern __at(0x0EAB) __sfr SMT2WINPPS;

typedef union
  {
  struct
    {
    unsigned SMU2WINPPS0        : 1;
    unsigned SMU2WINPPS1        : 1;
    unsigned SMU2WINPPS2        : 1;
    unsigned SMU2WINPPS3        : 1;
    unsigned SMU2WINPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMU2WINPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT2WINPPSbits_t;

extern __at(0x0EAB) volatile __SMT2WINPPSbits_t SMT2WINPPSbits;

#define _SMU2WINPPS0            0x01
#define _SMU2WINPPS1            0x02
#define _SMU2WINPPS2            0x04
#define _SMU2WINPPS3            0x08
#define _SMU2WINPPS4            0x10

//==============================================================================


//==============================================================================
//        SMT2SIGPPS Bits

extern __at(0x0EAC) __sfr SMT2SIGPPS;

typedef union
  {
  struct
    {
    unsigned SMU2SIGPPS0        : 1;
    unsigned SMU2SIGPPS1        : 1;
    unsigned SMU2SIGPPS2        : 1;
    unsigned SMU2SIGPPS3        : 1;
    unsigned SMU2SIGPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMU2SIGPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT2SIGPPSbits_t;

extern __at(0x0EAC) volatile __SMT2SIGPPSbits_t SMT2SIGPPSbits;

#define _SMU2SIGPPS0            0x01
#define _SMU2SIGPPS1            0x02
#define _SMU2SIGPPS2            0x04
#define _SMU2SIGPPS3            0x08
#define _SMU2SIGPPS4            0x10

//==============================================================================


//==============================================================================
//        CWG1PPS Bits

extern __at(0x0EB1) __sfr CWG1PPS;

typedef union
  {
  struct
    {
    unsigned CWG1PPS0           : 1;
    unsigned CWG1PPS1           : 1;
    unsigned CWG1PPS2           : 1;
    unsigned CWG1PPS3           : 1;
    unsigned CWG1PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1PPS            : 5;
    unsigned                    : 3;
    };
  } __CWG1PPSbits_t;

extern __at(0x0EB1) volatile __CWG1PPSbits_t CWG1PPSbits;

#define _CWG1PPS0               0x01
#define _CWG1PPS1               0x02
#define _CWG1PPS2               0x04
#define _CWG1PPS3               0x08
#define _CWG1PPS4               0x10

//==============================================================================


//==============================================================================
//        CWG2PPS Bits

extern __at(0x0EB2) __sfr CWG2PPS;

typedef union
  {
  struct
    {
    unsigned CWG2PPS0           : 1;
    unsigned CWG2PPS1           : 1;
    unsigned CWG2PPS2           : 1;
    unsigned CWG2PPS3           : 1;
    unsigned CWG2PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG2PPS            : 5;
    unsigned                    : 3;
    };
  } __CWG2PPSbits_t;

extern __at(0x0EB2) volatile __CWG2PPSbits_t CWG2PPSbits;

#define _CWG2PPS0               0x01
#define _CWG2PPS1               0x02
#define _CWG2PPS2               0x04
#define _CWG2PPS3               0x08
#define _CWG2PPS4               0x10

//==============================================================================


//==============================================================================
//        CWG3PPS Bits

extern __at(0x0EB3) __sfr CWG3PPS;

typedef union
  {
  struct
    {
    unsigned CWG3PPS0           : 1;
    unsigned CWG3PPS1           : 1;
    unsigned CWG3PPS2           : 1;
    unsigned CWG3PPS3           : 1;
    unsigned CWG3PPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG3PPS            : 5;
    unsigned                    : 3;
    };
  } __CWG3PPSbits_t;

extern __at(0x0EB3) volatile __CWG3PPSbits_t CWG3PPSbits;

#define _CWG3PPS0               0x01
#define _CWG3PPS1               0x02
#define _CWG3PPS2               0x04
#define _CWG3PPS3               0x08
#define _CWG3PPS4               0x10

//==============================================================================


//==============================================================================
//        MDCARLPPS Bits

extern __at(0x0EB8) __sfr MDCARLPPS;

typedef union
  {
  struct
    {
    unsigned MDCARLPPS0         : 1;
    unsigned MDCARLPPS1         : 1;
    unsigned MDCARLPPS2         : 1;
    unsigned MDCARLPPS3         : 1;
    unsigned MDCARLPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MDCARLPPS          : 5;
    unsigned                    : 3;
    };
  } __MDCARLPPSbits_t;

extern __at(0x0EB8) volatile __MDCARLPPSbits_t MDCARLPPSbits;

#define _MDCARLPPS0             0x01
#define _MDCARLPPS1             0x02
#define _MDCARLPPS2             0x04
#define _MDCARLPPS3             0x08
#define _MDCARLPPS4             0x10

//==============================================================================


//==============================================================================
//        MDCARHPPS Bits

extern __at(0x0EB9) __sfr MDCARHPPS;

typedef union
  {
  struct
    {
    unsigned MDCARHPPS0         : 1;
    unsigned MDCARHPPS1         : 1;
    unsigned MDCARHPPS2         : 1;
    unsigned MDCARHPPS3         : 1;
    unsigned MDCARHPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MDCARHPPS          : 5;
    unsigned                    : 3;
    };
  } __MDCARHPPSbits_t;

