OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
extern __at(0x0F18) volatile __RB0PPSbits_t RB0PPSbits;

#define _RB0PPS0                0x01
#define _RB0PPS1                0x02
#define _RB0PPS2                0x04
#define _RB0PPS3                0x08
#define _RB0PPS4                0x10
#define _RB0PPS5                0x20

//==============================================================================


//==============================================================================
//        RB1PPS Bits

extern __at(0x0F19) __sfr RB1PPS;

typedef union
  {
  struct
    {
    unsigned RB1PPS0            : 1;
    unsigned RB1PPS1            : 1;
    unsigned RB1PPS2            : 1;
    unsigned RB1PPS3            : 1;
    unsigned RB1PPS4            : 1;
    unsigned RB1PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB1PPS             : 6;
    unsigned                    : 2;
    };
  } __RB1PPSbits_t;

extern __at(0x0F19) volatile __RB1PPSbits_t RB1PPSbits;

#define _RB1PPS0                0x01
#define _RB1PPS1                0x02
#define _RB1PPS2                0x04
#define _RB1PPS3                0x08
#define _RB1PPS4                0x10
#define _RB1PPS5                0x20

//==============================================================================


//==============================================================================
//        RB2PPS Bits

extern __at(0x0F1A) __sfr RB2PPS;

typedef union
  {
  struct
    {
    unsigned RB2PPS0            : 1;
    unsigned RB2PPS1            : 1;
    unsigned RB2PPS2            : 1;
    unsigned RB2PPS3            : 1;
    unsigned RB2PPS4            : 1;
    unsigned RB2PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB2PPS             : 6;
    unsigned                    : 2;
    };
  } __RB2PPSbits_t;

extern __at(0x0F1A) volatile __RB2PPSbits_t RB2PPSbits;

#define _RB2PPS0                0x01
#define _RB2PPS1                0x02
#define _RB2PPS2                0x04
#define _RB2PPS3                0x08
#define _RB2PPS4                0x10
#define _RB2PPS5                0x20

//==============================================================================


//==============================================================================
//        RB3PPS Bits

extern __at(0x0F1B) __sfr RB3PPS;

typedef union
  {
  struct
    {
    unsigned RB3PPS0            : 1;
    unsigned RB3PPS1            : 1;
    unsigned RB3PPS2            : 1;
    unsigned RB3PPS3            : 1;
    unsigned RB3PPS4            : 1;
    unsigned RB3PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB3PPS             : 6;
    unsigned                    : 2;
    };
  } __RB3PPSbits_t;

extern __at(0x0F1B) volatile __RB3PPSbits_t RB3PPSbits;

#define _RB3PPS0                0x01
#define _RB3PPS1                0x02
#define _RB3PPS2                0x04
#define _RB3PPS3                0x08
#define _RB3PPS4                0x10
#define _RB3PPS5                0x20

//==============================================================================


//==============================================================================
//        RB4PPS Bits

extern __at(0x0F1C) __sfr RB4PPS;

typedef union
  {
  struct
    {
    unsigned RB4PPS0            : 1;
    unsigned RB4PPS1            : 1;
    unsigned RB4PPS2            : 1;
    unsigned RB4PPS3            : 1;
    unsigned RB4PPS4            : 1;
    unsigned RB4PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB4PPS             : 6;
    unsigned                    : 2;
    };
  } __RB4PPSbits_t;

extern __at(0x0F1C) volatile __RB4PPSbits_t RB4PPSbits;

#define _RB4PPS0                0x01
#define _RB4PPS1                0x02
#define _RB4PPS2                0x04
#define _RB4PPS3                0x08
#define _RB4PPS4                0x10
#define _RB4PPS5                0x20

//==============================================================================


//==============================================================================
//        RB5PPS Bits

extern __at(0x0F1D) __sfr RB5PPS;

typedef union
  {
  struct
    {
    unsigned RB5PPS0            : 1;
    unsigned RB5PPS1            : 1;
    unsigned RB5PPS2            : 1;
    unsigned RB5PPS3            : 1;
    unsigned RB5PPS4            : 1;
    unsigned RB5PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB5PPS             : 6;
    unsigned                    : 2;
    };
  } __RB5PPSbits_t;

extern __at(0x0F1D) volatile __RB5PPSbits_t RB5PPSbits;

#define _RB5PPS0                0x01
#define _RB5PPS1                0x02
#define _RB5PPS2                0x04
#define _RB5PPS3                0x08
#define _RB5PPS4                0x10
#define _RB5PPS5                0x20

//==============================================================================


//==============================================================================
//        RB6PPS Bits

extern __at(0x0F1E) __sfr RB6PPS;

typedef union
  {
  struct
    {
    unsigned RB6PPS0            : 1;
    unsigned RB6PPS1            : 1;
    unsigned RB6PPS2            : 1;
    unsigned RB6PPS3            : 1;
    unsigned RB6PPS4            : 1;
    unsigned RB6PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB6PPS             : 6;
    unsigned                    : 2;
    };
  } __RB6PPSbits_t;

extern __at(0x0F1E) volatile __RB6PPSbits_t RB6PPSbits;

#define _RB6PPS0                0x01
#define _RB6PPS1                0x02
#define _RB6PPS2                0x04
#define _RB6PPS3                0x08
#define _RB6PPS4                0x10
#define _RB6PPS5                0x20

//==============================================================================


//==============================================================================
//        RB7PPS Bits

extern __at(0x0F1F) __sfr RB7PPS;

typedef union
  {
  struct
    {
    unsigned RB7PPS0            : 1;
    unsigned RB7PPS1            : 1;
    unsigned RB7PPS2            : 1;
    unsigned RB7PPS3            : 1;
    unsigned RB7PPS4            : 1;
    unsigned RB7PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB7PPS             : 6;
    unsigned                    : 2;
    };
  } __RB7PPSbits_t;

