OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
#define ADGO                    ADCON0bits.ADGO                 // bit 0, shadows bit in ADCON0bits
#define DONE                    ADCON0bits.DONE                 // bit 0, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 0, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 0, shadows bit in ADCON0bits
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 0, shadows bit in ADCON0bits
#define ADFM0                   ADCON0bits.ADFM0                // bit 2
#define ADFM1                   ADCON0bits.ADFM1                // bit 3
#define ADCS                    ADCON0bits.ADCS                 // bit 4
#define ADCONT                  ADCON0bits.ADCONT               // bit 6
#define ADON                    ADCON0bits.ADON                 // bit 7

#define ADDSEN                  ADCON1bits.ADDSEN               // bit 0
#define ADGPOL                  ADCON1bits.ADGPOL               // bit 5
#define ADIPEN                  ADCON1bits.ADIPEN               // bit 6
#define ADPPOL                  ADCON1bits.ADPPOL               // bit 7

#define ADMD0                   ADCON2bits.ADMD0                // bit 0
#define ADMD1                   ADCON2bits.ADMD1                // bit 1
#define ADMD2                   ADCON2bits.ADMD2                // bit 2
#define ADACLR                  ADCON2bits.ADACLR               // bit 3
#define ADCRS0                  ADCON2bits.ADCRS0               // bit 4
#define ADCRS1                  ADCON2bits.ADCRS1               // bit 5
#define ADCRS2                  ADCON2bits.ADCRS2               // bit 6
#define ADPSIS                  ADCON2bits.ADPSIS               // bit 7

#define ADTMD0                  ADCON3bits.ADTMD0               // bit 0
#define ADTMD1                  ADCON3bits.ADTMD1               // bit 1
#define ADTMD2                  ADCON3bits.ADTMD2               // bit 2
#define ADSOI                   ADCON3bits.ADSOI                // bit 3
#define ADCALC0                 ADCON3bits.ADCALC0              // bit 4
#define ADCALC1                 ADCON3bits.ADCALC1              // bit 5
#define ADCALC2                 ADCON3bits.ADCALC2              // bit 6

#define ADERR8                  ADERRHbits.ADERR8               // bit 0
#define ADERR9                  ADERRHbits.ADERR9               // bit 1
#define ADERR10                 ADERRHbits.ADERR10              // bit 2
#define ADERR11                 ADERRHbits.ADERR11              // bit 3
#define ADERR12                 ADERRHbits.ADERR12              // bit 4
#define ADERR13                 ADERRHbits.ADERR13              // bit 5
#define ADERR14                 ADERRHbits.ADERR14              // bit 6
#define ADERR15                 ADERRHbits.ADERR15              // bit 7

#define ADERR0                  ADERRLbits.ADERR0               // bit 0
#define ADERR1                  ADERRLbits.ADERR1               // bit 1
#define ADERR2                  ADERRLbits.ADERR2               // bit 2
#define ADERR3                  ADERRLbits.ADERR3               // bit 3
#define ADERR4                  ADERRLbits.ADERR4               // bit 4
#define ADERR5                  ADERRLbits.ADERR5               // bit 5
#define ADERR6                  ADERRLbits.ADERR6               // bit 6
#define ADERR7                  ADERRLbits.ADERR7               // bit 7

#define ADFLTR8                 ADFLTRHbits.ADFLTR8             // bit 0
#define ADFLTR9                 ADFLTRHbits.ADFLTR9             // bit 1
#define ADFLTR10                ADFLTRHbits.ADFLTR10            // bit 2
#define ADFLTR11                ADFLTRHbits.ADFLTR11            // bit 3
#define ADFLTR12                ADFLTRHbits.ADFLTR12            // bit 4
#define ADFLTR13                ADFLTRHbits.ADFLTR13            // bit 5
#define ADFLTR14                ADFLTRHbits.ADFLTR14            // bit 6
#define ADFLTR15                ADFLTRHbits.ADFLTR15            // bit 7

#define ADFLTR0                 ADFLTRLbits.ADFLTR0             // bit 0
#define ADFLTR1                 ADFLTRLbits.ADFLTR1             // bit 1
#define ADFLTR2                 ADFLTRLbits.ADFLTR2             // bit 2
#define ADFLTR3                 ADFLTRLbits.ADFLTR3             // bit 3
#define ADFLTR4                 ADFLTRLbits.ADFLTR4             // bit 4
#define ADFLTR5                 ADFLTRLbits.ADFLTR5             // bit 5
#define ADFLTR6                 ADFLTRLbits.ADFLTR6             // bit 6
#define ADFLTR7                 ADFLTRLbits.ADFLTR7             // bit 7

#define ADLTH8                  ADLTHHbits.ADLTH8               // bit 0
#define ADLTH9                  ADLTHHbits.ADLTH9               // bit 1
#define ADLTH10                 ADLTHHbits.ADLTH10              // bit 2
#define ADLTH11                 ADLTHHbits.ADLTH11              // bit 3
#define ADLTH12                 ADLTHHbits.ADLTH12              // bit 4
#define ADLTH13                 ADLTHHbits.ADLTH13              // bit 5
#define ADLTH14                 ADLTHHbits.ADLTH14              // bit 6
#define ADLTH15                 ADLTHHbits.ADLTH15              // bit 7

#define ADLTH0                  ADLTHLbits.ADLTH0               // bit 0
#define ADLTH1                  ADLTHLbits.ADLTH1               // bit 1
#define ADLTH2                  ADLTHLbits.ADLTH2               // bit 2
#define ADLTH3                  ADLTHLbits.ADLTH3               // bit 3
#define ADLTH4                  ADLTHLbits.ADLTH4               // bit 4
#define ADLTH5                  ADLTHLbits.ADLTH5               // bit 5
#define ADLTH6                  ADLTHLbits.ADLTH6               // bit 6
#define ADLTH7                  ADLTHLbits.ADLTH7               // bit 7

#define ADPCH0                  ADPCHbits.ADPCH0                // bit 0
#define ADPCH1                  ADPCHbits.ADPCH1                // bit 1
#define ADPCH2                  ADPCHbits.ADPCH2                // bit 2
#define ADPCH3                  ADPCHbits.ADPCH3                // bit 3
#define ADPCH4                  ADPCHbits.ADPCH4                // bit 4
#define ADPCH5                  ADPCHbits.ADPCH5                // bit 5

#define ADPRE0                  ADPREbits.ADPRE0                // bit 0
#define ADPRE1                  ADPREbits.ADPRE1                // bit 1
#define ADPRE2                  ADPREbits.ADPRE2                // bit 2
#define ADPRE3                  ADPREbits.ADPRE3                // bit 3
#define ADPRE4                  ADPREbits.ADPRE4                // bit 4
#define ADPRE5                  ADPREbits.ADPRE5                // bit 5
#define ADPRE6                  ADPREbits.ADPRE6                // bit 6
#define ADPRE7                  ADPREbits.ADPRE7                // bit 7

