OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
#define CLCIN1PPS0              CLCIN1PPSbits.CLCIN1PPS0        // bit 0
#define CLCIN1PPS1              CLCIN1PPSbits.CLCIN1PPS1        // bit 1
#define CLCIN1PPS2              CLCIN1PPSbits.CLCIN1PPS2        // bit 2
#define CLCIN1PPS3              CLCIN1PPSbits.CLCIN1PPS3        // bit 3
#define CLCIN1PPS4              CLCIN1PPSbits.CLCIN1PPS4        // bit 4

#define CLCIN2PPS0              CLCIN2PPSbits.CLCIN2PPS0        // bit 0
#define CLCIN2PPS1              CLCIN2PPSbits.CLCIN2PPS1        // bit 1
#define CLCIN2PPS2              CLCIN2PPSbits.CLCIN2PPS2        // bit 2
#define CLCIN2PPS3              CLCIN2PPSbits.CLCIN2PPS3        // bit 3
#define CLCIN2PPS4              CLCIN2PPSbits.CLCIN2PPS4        // bit 4

#define CLCIN3PPS0              CLCIN3PPSbits.CLCIN3PPS0        // bit 0
#define CLCIN3PPS1              CLCIN3PPSbits.CLCIN3PPS1        // bit 1
#define CLCIN3PPS2              CLCIN3PPSbits.CLCIN3PPS2        // bit 2
#define CLCIN3PPS3              CLCIN3PPSbits.CLCIN3PPS3        // bit 3
#define CLCIN3PPS4              CLCIN3PPSbits.CLCIN3PPS4        // bit 4

#define CLKRCLK0                CLKRCLKbits.CLKRCLK0            // bit 0
#define CLKRCLK1                CLKRCLKbits.CLKRCLK1            // bit 1
#define CLKRCLK2                CLKRCLKbits.CLKRCLK2            // bit 2
#define CLKRCLK3                CLKRCLKbits.CLKRCLK3            // bit 3

#define CLKRDIV0                CLKRCONbits.CLKRDIV0            // bit 0
#define CLKRDIV1                CLKRCONbits.CLKRDIV1            // bit 1
#define CLKRDIV2                CLKRCONbits.CLKRDIV2            // bit 2
#define CLKRDC0                 CLKRCONbits.CLKRDC0             // bit 3
#define CLKRDC1                 CLKRCONbits.CLKRDC1             // bit 4
#define CLKREN                  CLKRCONbits.CLKREN              // bit 7

#define NCH0                    CM1NSELbits.NCH0                // bit 0, shadows bit in CM1NSELbits
#define C1NCH0                  CM1NSELbits.C1NCH0              // bit 0, shadows bit in CM1NSELbits
#define NCH1                    CM1NSELbits.NCH1                // bit 1, shadows bit in CM1NSELbits
#define C1NCH1                  CM1NSELbits.C1NCH1              // bit 1, shadows bit in CM1NSELbits
#define NCH2                    CM1NSELbits.NCH2                // bit 2, shadows bit in CM1NSELbits
#define C1NCH2                  CM1NSELbits.C1NCH2              // bit 2, shadows bit in CM1NSELbits

#define PCH0                    CM1PSELbits.PCH0                // bit 0, shadows bit in CM1PSELbits
#define C1PCH0                  CM1PSELbits.C1PCH0              // bit 0, shadows bit in CM1PSELbits
#define PCH1                    CM1PSELbits.PCH1                // bit 1, shadows bit in CM1PSELbits
#define C1PCH1                  CM1PSELbits.C1PCH1              // bit 1, shadows bit in CM1PSELbits
#define PCH2                    CM1PSELbits.PCH2                // bit 2, shadows bit in CM1PSELbits
#define C1PCH2                  CM1PSELbits.C1PCH2              // bit 2, shadows bit in CM1PSELbits

#define DOZE0                   CPUDOZEbits.DOZE0               // bit 0
#define DOZE1                   CPUDOZEbits.DOZE1               // bit 1
#define DOZE2                   CPUDOZEbits.DOZE2               // bit 2
#define DOE                     CPUDOZEbits.DOE                 // bit 4
#define ROI                     CPUDOZEbits.ROI                 // bit 5
#define DOZEN                   CPUDOZEbits.DOZEN               // bit 6
#define IDLEN                   CPUDOZEbits.IDLEN               // bit 7

#define ACC8                    CRCACCHbits.ACC8                // bit 0
#define ACC9                    CRCACCHbits.ACC9                // bit 1
#define ACC10                   CRCACCHbits.ACC10               // bit 2
#define ACC11                   CRCACCHbits.ACC11               // bit 3
#define ACC12                   CRCACCHbits.ACC12               // bit 4
#define ACC13                   CRCACCHbits.ACC13               // bit 5
#define ACC14                   CRCACCHbits.ACC14               // bit 6
#define ACC15                   CRCACCHbits.ACC15               // bit 7

#define ACC0                    CRCACCLbits.ACC0                // bit 0
#define ACC1                    CRCACCLbits.ACC1                // bit 1
#define ACC2                    CRCACCLbits.ACC2                // bit 2
#define ACC3                    CRCACCLbits.ACC3                // bit 3
#define ACC4                    CRCACCLbits.ACC4                // bit 4
#define ACC5                    CRCACCLbits.ACC5                // bit 5
#define ACC6                    CRCACCLbits.ACC6                // bit 6
#define ACC7                    CRCACCLbits.ACC7                // bit 7

#define PLEN0                   CRCCON1bits.PLEN0               // bit 0
#define PLEN1                   CRCCON1bits.PLEN1               // bit 1
#define PLEN2                   CRCCON1bits.PLEN2               // bit 2
#define PLEN3                   CRCCON1bits.PLEN3               // bit 3
#define DLEN0                   CRCCON1bits.DLEN0               // bit 4
#define DLEN1                   CRCCON1bits.DLEN1               // bit 5
#define DLEN2                   CRCCON1bits.DLEN2               // bit 6
#define DLEN3                   CRCCON1bits.DLEN3               // bit 7

#define DATA8                   CRCDATHbits.DATA8               // bit 0
#define DATA9                   CRCDATHbits.DATA9               // bit 1
#define DATA10                  CRCDATHbits.DATA10              // bit 2
#define DATA11                  CRCDATHbits.DATA11              // bit 3
#define DATA12                  CRCDATHbits.DATA12              // bit 4
#define DATA13                  CRCDATHbits.DATA13              // bit 5
#define DATA14                  CRCDATHbits.DATA14              // bit 6
#define DATA15                  CRCDATHbits.DATA15              // bit 7

#define DATA0                   CRCDATLbits.DATA0               // bit 0
#define DATA1                   CRCDATLbits.DATA1               // bit 1
#define DATA2                   CRCDATLbits.DATA2               // bit 2
#define DATA3                   CRCDATLbits.DATA3               // bit 3
#define DATA4                   CRCDATLbits.DATA4               // bit 4
#define DATA5                   CRCDATLbits.DATA5               // bit 5
#define DATA6                   CRCDATLbits.DATA6               // bit 6
#define DATA7                   CRCDATLbits.DATA7               // bit 7

#define SHFT8                   CRCSHIFTHbits.SHFT8             // bit 0
#define SHFT9                   CRCSHIFTHbits.SHFT9             // bit 1
#define SHFT10                  CRCSHIFTHbits.SHFT10            // bit 2
#define SHFT11                  CRCSHIFTHbits.SHFT11            // bit 3
#define SHFT12                  CRCSHIFTHbits.SHFT12            // bit 4
#define SHFT13                  CRCSHIFTHbits.SHFT13            // bit 5
#define SHFT14                  CRCSHIFTHbits.SHFT14            // bit 6
#define SHFT15                  CRCSHIFTHbits.SHFT15            // bit 7

#define SHFT0                   CRCSHIFTLbits.SHFT0             // bit 0
#define SHFT1                   CRCSHIFTLbits.SHFT1             // bit 1
#define SHFT2                   CRCSHIFTLbits.SHFT2             // bit 2
#define SHFT3                   CRCSHIFTLbits.SHFT3             // bit 3
#define SHFT4                   CRCSHIFTLbits.SHFT4             // bit 4
#define SHFT5                   CRCSHIFTLbits.SHFT5             // bit 5
#define SHFT6                   CRCSHIFTLbits.SHFT6             // bit 6
#define SHFT7                   CRCSHIFTLbits.SHFT7             // bit 7

#define X8                      CRCXORHbits.X8                  // bit 0
#define X9                      CRCXORHbits.X9                  // bit 1
#define X10                     CRCXORHbits.X10                 // bit 2
#define X11                     CRCXORHbits.X11                 // bit 3
#define X12                     CRCXORHbits.X12                 // bit 4
#define X13                     CRCXORHbits.X13                 // bit 5
#define X14                     CRCXORHbits.X14                 // bit 6
#define X15                     CRCXORHbits.X15                 // bit 7

