OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
#define DC0                     PWM6DCLbits.DC0                 // bit 6, shadows bit in PWM6DCLbits
#define PWM6DC0                 PWM6DCLbits.PWM6DC0             // bit 6, shadows bit in PWM6DCLbits
#define PWMPW0                  PWM6DCLbits.PWMPW0              // bit 6, shadows bit in PWM6DCLbits
#define DC1                     PWM6DCLbits.DC1                 // bit 7, shadows bit in PWM6DCLbits
#define PWM6DC1                 PWM6DCLbits.PWM6DC1             // bit 7, shadows bit in PWM6DCLbits
#define PWMPW1                  PWM6DCLbits.PWMPW1              // bit 7, shadows bit in PWM6DCLbits

#define RA0PPS0                 RA0PPSbits.RA0PPS0              // bit 0
#define RA0PPS1                 RA0PPSbits.RA0PPS1              // bit 1
#define RA0PPS2                 RA0PPSbits.RA0PPS2              // bit 2
#define RA0PPS3                 RA0PPSbits.RA0PPS3              // bit 3
#define RA0PPS4                 RA0PPSbits.RA0PPS4              // bit 4
#define RA0PPS5                 RA0PPSbits.RA0PPS5              // bit 5

#define RA1PPS0                 RA1PPSbits.RA1PPS0              // bit 0
#define RA1PPS1                 RA1PPSbits.RA1PPS1              // bit 1
#define RA1PPS2                 RA1PPSbits.RA1PPS2              // bit 2
#define RA1PPS3                 RA1PPSbits.RA1PPS3              // bit 3
#define RA1PPS4                 RA1PPSbits.RA1PPS4              // bit 4
#define RA1PPS5                 RA1PPSbits.RA1PPS5              // bit 5

#define RA2PPS0                 RA2PPSbits.RA2PPS0              // bit 0
#define RA2PPS1                 RA2PPSbits.RA2PPS1              // bit 1
#define RA2PPS2                 RA2PPSbits.RA2PPS2              // bit 2
#define RA2PPS3                 RA2PPSbits.RA2PPS3              // bit 3
#define RA2PPS4                 RA2PPSbits.RA2PPS4              // bit 4
#define RA2PPS5                 RA2PPSbits.RA2PPS5              // bit 5

#define RA3PPS0                 RA3PPSbits.RA3PPS0              // bit 0
#define RA3PPS1                 RA3PPSbits.RA3PPS1              // bit 1
#define RA3PPS2                 RA3PPSbits.RA3PPS2              // bit 2
#define RA3PPS3                 RA3PPSbits.RA3PPS3              // bit 3
#define RA3PPS4                 RA3PPSbits.RA3PPS4              // bit 4
#define RA3PPS5                 RA3PPSbits.RA3PPS5              // bit 5

#define RA4PPS0                 RA4PPSbits.RA4PPS0              // bit 0
#define RA4PPS1                 RA4PPSbits.RA4PPS1              // bit 1
#define RA4PPS2                 RA4PPSbits.RA4PPS2              // bit 2
#define RA4PPS3                 RA4PPSbits.RA4PPS3              // bit 3
#define RA4PPS4                 RA4PPSbits.RA4PPS4              // bit 4
#define RA4PPS5                 RA4PPSbits.RA4PPS5              // bit 5

#define RA5PPS0                 RA5PPSbits.RA5PPS0              // bit 0
#define RA5PPS1                 RA5PPSbits.RA5PPS1              // bit 1
#define RA5PPS2                 RA5PPSbits.RA5PPS2              // bit 2
#define RA5PPS3                 RA5PPSbits.RA5PPS3              // bit 3
#define RA5PPS4                 RA5PPSbits.RA5PPS4              // bit 4
#define RA5PPS5                 RA5PPSbits.RA5PPS5              // bit 5

#define RA6PPS0                 RA6PPSbits.RA6PPS0              // bit 0
#define RA6PPS1                 RA6PPSbits.RA6PPS1              // bit 1
#define RA6PPS2                 RA6PPSbits.RA6PPS2              // bit 2
#define RA6PPS3                 RA6PPSbits.RA6PPS3              // bit 3
#define RA6PPS4                 RA6PPSbits.RA6PPS4              // bit 4
#define RA6PPS5                 RA6PPSbits.RA6PPS5              // bit 5

#define RA7PPS0                 RA7PPSbits.RA7PPS0              // bit 0
#define RA7PPS1                 RA7PPSbits.RA7PPS1              // bit 1
#define RA7PPS2                 RA7PPSbits.RA7PPS2              // bit 2
#define RA7PPS3                 RA7PPSbits.RA7PPS3              // bit 3
#define RA7PPS4                 RA7PPSbits.RA7PPS4              // bit 4
#define RA7PPS5                 RA7PPSbits.RA7PPS5              // bit 5

#define RB0PPS0                 RB0PPSbits.RB0PPS0              // bit 0
#define RB0PPS1                 RB0PPSbits.RB0PPS1              // bit 1
#define RB0PPS2                 RB0PPSbits.RB0PPS2              // bit 2
#define RB0PPS3                 RB0PPSbits.RB0PPS3              // bit 3
#define RB0PPS4                 RB0PPSbits.RB0PPS4              // bit 4
#define RB0PPS5                 RB0PPSbits.RB0PPS5              // bit 5

#define RB1PPS0                 RB1PPSbits.RB1PPS0              // bit 0
#define RB1PPS1                 RB1PPSbits.RB1PPS1              // bit 1
#define RB1PPS2                 RB1PPSbits.RB1PPS2              // bit 2
#define RB1PPS3                 RB1PPSbits.RB1PPS3              // bit 3
#define RB1PPS4                 RB1PPSbits.RB1PPS4              // bit 4
#define RB1PPS5                 RB1PPSbits.RB1PPS5              // bit 5

#define RB2PPS0                 RB2PPSbits.RB2PPS0              // bit 0
#define RB2PPS1                 RB2PPSbits.RB2PPS1              // bit 1
#define RB2PPS2                 RB2PPSbits.RB2PPS2              // bit 2
#define RB2PPS3                 RB2PPSbits.RB2PPS3              // bit 3
#define RB2PPS4                 RB2PPSbits.RB2PPS4              // bit 4
#define RB2PPS5                 RB2PPSbits.RB2PPS5              // bit 5

#define RB3PPS0                 RB3PPSbits.RB3PPS0              // bit 0
#define RB3PPS1                 RB3PPSbits.RB3PPS1              // bit 1
#define RB3PPS2                 RB3PPSbits.RB3PPS2              // bit 2
#define RB3PPS3                 RB3PPSbits.RB3PPS3              // bit 3
#define RB3PPS4                 RB3PPSbits.RB3PPS4              // bit 4
#define RB3PPS5                 RB3PPSbits.RB3PPS5              // bit 5

#define RB4PPS0                 RB4PPSbits.RB4PPS0              // bit 0
#define RB4PPS1                 RB4PPSbits.RB4PPS1              // bit 1
#define RB4PPS2                 RB4PPSbits.RB4PPS2              // bit 2
#define RB4PPS3                 RB4PPSbits.RB4PPS3              // bit 3
#define RB4PPS4                 RB4PPSbits.RB4PPS4              // bit 4
#define RB4PPS5                 RB4PPSbits.RB4PPS5              // bit 5

#define RB5PPS0                 RB5PPSbits.RB5PPS0              // bit 0
#define RB5PPS1                 RB5PPSbits.RB5PPS1              // bit 1
#define RB5PPS2                 RB5PPSbits.RB5PPS2              // bit 2
#define RB5PPS3                 RB5PPSbits.RB5PPS3              // bit 3
#define RB5PPS4                 RB5PPSbits.RB5PPS4              // bit 4
#define RB5PPS5                 RB5PPSbits.RB5PPS5              // bit 5

#define RB6PPS0                 RB6PPSbits.RB6PPS0              // bit 0
#define RB6PPS1                 RB6PPSbits.RB6PPS1              // bit 1
#define RB6PPS2                 RB6PPSbits.RB6PPS2              // bit 2
#define RB6PPS3                 RB6PPSbits.RB6PPS3              // bit 3
#define RB6PPS4                 RB6PPSbits.RB6PPS4              // bit 4
#define RB6PPS5                 RB6PPSbits.RB6PPS5              // bit 5

#define RB7PPS0                 RB7PPSbits.RB7PPS0              // bit 0
#define RB7PPS1                 RB7PPSbits.RB7PPS1              // bit 1
#define RB7PPS2                 RB7PPSbits.RB7PPS2              // bit 2
#define RB7PPS3                 RB7PPSbits.RB7PPS3              // bit 3
#define RB7PPS4                 RB7PPSbits.RB7PPS4              // bit 4
#define RB7PPS5                 RB7PPSbits.RB7PPS5              // bit 5

#define RC0PPS0                 RC0PPSbits.RC0PPS0              // bit 0
#define RC0PPS1                 RC0PPSbits.RC0PPS1              // bit 1
#define RC0PPS2                 RC0PPSbits.RC0PPS2              // bit 2
#define RC0PPS3                 RC0PPSbits.RC0PPS3              // bit 3
#define RC0PPS4                 RC0PPSbits.RC0PPS4              // bit 4
#define RC0PPS5                 RC0PPSbits.RC0PPS5              // bit 5

#define RC1PPS0                 RC1PPSbits.RC1PPS0              // bit 0
#define RC1PPS1                 RC1PPSbits.RC1PPS1              // bit 1
#define RC1PPS2                 RC1PPSbits.RC1PPS2              // bit 2
#define RC1PPS3                 RC1PPSbits.RC1PPS3              // bit 3
#define RC1PPS4                 RC1PPSbits.RC1PPS4              // bit 4
#define RC1PPS5                 RC1PPSbits.RC1PPS5              // bit 5

