OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18855.h
#define T6CS0                   T6CLKCONbits.T6CS0              // bit 0
#define T6CS1                   T6CLKCONbits.T6CS1              // bit 1
#define T6CS2                   T6CLKCONbits.T6CS2              // bit 2
#define T6CS3                   T6CLKCONbits.T6CS3              // bit 3

#define TMR0L0                  TMR0bits.TMR0L0                 // bit 0
#define TMR0L1                  TMR0bits.TMR0L1                 // bit 1
#define TMR0L2                  TMR0bits.TMR0L2                 // bit 2
#define TMR0L3                  TMR0bits.TMR0L3                 // bit 3
#define TMR0L4                  TMR0bits.TMR0L4                 // bit 4
#define TMR0L5                  TMR0bits.TMR0L5                 // bit 5
#define TMR0L6                  TMR0bits.TMR0L6                 // bit 6
#define TMR0L7                  TMR0bits.TMR0L7                 // bit 7

#define TMR1H0                  TMR1Hbits.TMR1H0                // bit 0
#define TMR1H1                  TMR1Hbits.TMR1H1                // bit 1
#define TMR1H2                  TMR1Hbits.TMR1H2                // bit 2
#define TMR1H3                  TMR1Hbits.TMR1H3                // bit 3
#define TMR1H4                  TMR1Hbits.TMR1H4                // bit 4
#define TMR1H5                  TMR1Hbits.TMR1H5                // bit 5
#define TMR1H6                  TMR1Hbits.TMR1H6                // bit 6
#define TMR1H7                  TMR1Hbits.TMR1H7                // bit 7

#define TMR1L0                  TMR1Lbits.TMR1L0                // bit 0
#define TMR1L1                  TMR1Lbits.TMR1L1                // bit 1
#define TMR1L2                  TMR1Lbits.TMR1L2                // bit 2
#define TMR1L3                  TMR1Lbits.TMR1L3                // bit 3
#define TMR1L4                  TMR1Lbits.TMR1L4                // bit 4
#define TMR1L5                  TMR1Lbits.TMR1L5                // bit 5
#define TMR1L6                  TMR1Lbits.TMR1L6                // bit 6
#define TMR1L7                  TMR1Lbits.TMR1L7                // bit 7

#define TMR3H0                  TMR3Hbits.TMR3H0                // bit 0
#define TMR3H1                  TMR3Hbits.TMR3H1                // bit 1
#define TMR3H2                  TMR3Hbits.TMR3H2                // bit 2
#define TMR3H3                  TMR3Hbits.TMR3H3                // bit 3
#define TMR3H4                  TMR3Hbits.TMR3H4                // bit 4
#define TMR3H5                  TMR3Hbits.TMR3H5                // bit 5
#define TMR3H6                  TMR3Hbits.TMR3H6                // bit 6
#define TMR3H7                  TMR3Hbits.TMR3H7                // bit 7

#define TMR3L0                  TMR3Lbits.TMR3L0                // bit 0
#define TMR3L1                  TMR3Lbits.TMR3L1                // bit 1
#define TMR3L2                  TMR3Lbits.TMR3L2                // bit 2
#define TMR3L3                  TMR3Lbits.TMR3L3                // bit 3
#define TMR3L4                  TMR3Lbits.TMR3L4                // bit 4
#define TMR3L5                  TMR3Lbits.TMR3L5                // bit 5
#define TMR3L6                  TMR3Lbits.TMR3L6                // bit 6
#define TMR3L7                  TMR3Lbits.TMR3L7                // bit 7

#define TMR5H0                  TMR5Hbits.TMR5H0                // bit 0
#define TMR5H1                  TMR5Hbits.TMR5H1                // bit 1
#define TMR5H2                  TMR5Hbits.TMR5H2                // bit 2
#define TMR5H3                  TMR5Hbits.TMR5H3                // bit 3
#define TMR5H4                  TMR5Hbits.TMR5H4                // bit 4
#define TMR5H5                  TMR5Hbits.TMR5H5                // bit 5
#define TMR5H6                  TMR5Hbits.TMR5H6                // bit 6
#define TMR5H7                  TMR5Hbits.TMR5H7                // bit 7

#define TMR5L0                  TMR5Lbits.TMR5L0                // bit 0
#define TMR5L1                  TMR5Lbits.TMR5L1                // bit 1
#define TMR5L2                  TMR5Lbits.TMR5L2                // bit 2
#define TMR5L3                  TMR5Lbits.TMR5L3                // bit 3
#define TMR5L4                  TMR5Lbits.TMR5L4                // bit 4
#define TMR5L5                  TMR5Lbits.TMR5L5                // bit 5
#define TMR5L6                  TMR5Lbits.TMR5L6                // bit 6
#define TMR5L7                  TMR5Lbits.TMR5L7                // bit 7

#define TRISA0                  TRISAbits.TRISA0                // bit 0
#define TRISA1                  TRISAbits.TRISA1                // bit 1
#define TRISA2                  TRISAbits.TRISA2                // bit 2
#define TRISA3                  TRISAbits.TRISA3                // bit 3
#define TRISA4                  TRISAbits.TRISA4                // bit 4
#define TRISA5                  TRISAbits.TRISA5                // bit 5
#define TRISA6                  TRISAbits.TRISA6                // bit 6
#define TRISA7                  TRISAbits.TRISA7                // bit 7

#define TRISB0                  TRISBbits.TRISB0                // bit 0
#define TRISB1                  TRISBbits.TRISB1                // bit 1
#define TRISB2                  TRISBbits.TRISB2                // bit 2
#define TRISB3                  TRISBbits.TRISB3                // bit 3
#define TRISB4                  TRISBbits.TRISB4                // bit 4
#define TRISB5                  TRISBbits.TRISB5                // bit 5
#define TRISB6                  TRISBbits.TRISB6                // bit 6
#define TRISB7                  TRISBbits.TRISB7                // bit 7

#define TRISC0                  TRISCbits.TRISC0                // bit 0
#define TRISC1                  TRISCbits.TRISC1                // bit 1
#define TRISC2                  TRISCbits.TRISC2                // bit 2
#define TRISC3                  TRISCbits.TRISC3                // bit 3
#define TRISC4                  TRISCbits.TRISC4                // bit 4
#define TRISC5                  TRISCbits.TRISC5                // bit 5
#define TRISC6                  TRISCbits.TRISC6                // bit 6
#define TRISC7                  TRISCbits.TRISC7                // bit 7

#define TXPPS0                  TXPPSbits.TXPPS0                // bit 0
#define TXPPS1                  TXPPSbits.TXPPS1                // bit 1
#define TXPPS2                  TXPPSbits.TXPPS2                // bit 2
#define TXPPS3                  TXPPSbits.TXPPS3                // bit 3
#define TXPPS4                  TXPPSbits.TXPPS4                // bit 4

#define VREGPM0                 VREGCONbits.VREGPM0             // bit 0
#define VREGPM1                 VREGCONbits.VREGPM1             // bit 1, shadows bit in VREGCONbits
#define VREGPM                  VREGCONbits.VREGPM              // bit 1, shadows bit in VREGCONbits

#define WINDOW0                 WDTCON1bits.WINDOW0             // bit 0, shadows bit in WDTCON1bits
#define WDTWINDOW0              WDTCON1bits.WDTWINDOW0          // bit 0, shadows bit in WDTCON1bits
#define WINDOW1                 WDTCON1bits.WINDOW1             // bit 1, shadows bit in WDTCON1bits
#define WDTWINDOW1              WDTCON1bits.WDTWINDOW1          // bit 1, shadows bit in WDTCON1bits
#define WINDOW2                 WDTCON1bits.WINDOW2             // bit 2, shadows bit in WDTCON1bits
#define WDTWINDOW2              WDTCON1bits.WDTWINDOW2          // bit 2, shadows bit in WDTCON1bits
#define WDTCS0                  WDTCON1bits.WDTCS0              // bit 4
#define WDTCS1                  WDTCON1bits.WDTCS1              // bit 5
#define WDTCS2                  WDTCON1bits.WDTCS2              // bit 6

#define PSCNT8                  WDTPSHbits.PSCNT8               // bit 0, shadows bit in WDTPSHbits
#define WDTPSCNT8               WDTPSHbits.WDTPSCNT8            // bit 0, shadows bit in WDTPSHbits
#define PSCNT9                  WDTPSHbits.PSCNT9               // bit 1, shadows bit in WDTPSHbits
#define WDTPSCNT9               WDTPSHbits.WDTPSCNT9            // bit 1, shadows bit in WDTPSHbits
#define PSCNT10                 WDTPSHbits.PSCNT10              // bit 2, shadows bit in WDTPSHbits
#define WDTPSCNT10              WDTPSHbits.WDTPSCNT10           // bit 2, shadows bit in WDTPSHbits
#define PSCNT11                 WDTPSHbits.PSCNT11              // bit 3, shadows bit in WDTPSHbits
#define WDTPSCNT11              WDTPSHbits.WDTPSCNT11           // bit 3, shadows bit in WDTPSHbits
#define PSCNT12                 WDTPSHbits.PSCNT12              // bit 4, shadows bit in WDTPSHbits
#define WDTPSCNT12              WDTPSHbits.WDTPSCNT12           // bit 4, shadows bit in WDTPSHbits
#define PSCNT13                 WDTPSHbits.PSCNT13              // bit 5, shadows bit in WDTPSHbits
#define WDTPSCNT13              WDTPSHbits.WDTPSCNT13           // bit 5, shadows bit in WDTPSHbits
#define PSCNT14                 WDTPSHbits.PSCNT14              // bit 6, shadows bit in WDTPSHbits
#define WDTPSCNT14              WDTPSHbits.WDTPSCNT14           // bit 6, shadows bit in WDTPSHbits
#define PSCNT15                 WDTPSHbits.PSCNT15              // bit 7, shadows bit in WDTPSHbits
#define WDTPSCNT15              WDTPSHbits.WDTPSCNT15           // bit 7, shadows bit in WDTPSHbits

#define PSCNT0                  WDTPSLbits.PSCNT0               // bit 0, shadows bit in WDTPSLbits
#define WDTPSCNT0               WDTPSLbits.WDTPSCNT0            // bit 0, shadows bit in WDTPSLbits
#define PSCNT1                  WDTPSLbits.PSCNT1               // bit 1, shadows bit in WDTPSLbits
#define WDTPSCNT1               WDTPSLbits.WDTPSCNT1            // bit 1, shadows bit in WDTPSLbits
#define PSCNT2                  WDTPSLbits.PSCNT2               // bit 2, shadows bit in WDTPSLbits
#define WDTPSCNT2               WDTPSLbits.WDTPSCNT2            // bit 2, shadows bit in WDTPSLbits
#define PSCNT3                  WDTPSLbits.PSCNT3               // bit 3, shadows bit in WDTPSLbits
#define WDTPSCNT3               WDTPSLbits.WDTPSCNT3            // bit 3, shadows bit in WDTPSLbits
#define PSCNT4                  WDTPSLbits.PSCNT4               // bit 4, shadows bit in WDTPSLbits
#define WDTPSCNT4               WDTPSLbits.WDTPSCNT4            // bit 4, shadows bit in WDTPSLbits
#define PSCNT5                  WDTPSLbits.PSCNT5               // bit 5, shadows bit in WDTPSLbits
#define WDTPSCNT5               WDTPSLbits.WDTPSCNT5            // bit 5, shadows bit in WDTPSLbits
#define PSCNT6                  WDTPSLbits.PSCNT6               // bit 6, shadows bit in WDTPSLbits
#define WDTPSCNT6               WDTPSLbits.WDTPSCNT6            // bit 6, shadows bit in WDTPSLbits
#define PSCNT7                  WDTPSLbits.PSCNT7               // bit 7, shadows bit in WDTPSLbits
#define WDTPSCNT7               WDTPSLbits.WDTPSCNT7            // bit 7, shadows bit in WDTPSLbits

#define PSCNT16                 WDTTMRbits.PSCNT16              // bit 0, shadows bit in WDTTMRbits
#define WDTPSCNT16              WDTTMRbits.WDTPSCNT16           // bit 0, shadows bit in WDTTMRbits
#define PSCNT17                 WDTTMRbits.PSCNT17              // bit 1, shadows bit in WDTTMRbits
#define WDTPSCNT17              WDTTMRbits.WDTPSCNT17           // bit 1, shadows bit in WDTTMRbits
#define STATE                   WDTTMRbits.STATE                // bit 2, shadows bit in WDTTMRbits
#define WDTSTATE                WDTTMRbits.WDTSTATE             // bit 2, shadows bit in WDTTMRbits
#define WDTTMR0                 WDTTMRbits.WDTTMR0              // bit 3
#define WDTTMR1                 WDTTMRbits.WDTTMR1              // bit 4
#define WDTTMR2                 WDTTMRbits.WDTTMR2              // bit 5
#define WDTTMR3                 WDTTMRbits.WDTTMR3              // bit 6

